'''
    변수 / 연산자 / 제어문 / 함수
    응용 = database 연동
            데이터 수집 bs4
            데이터 통계 / 분석 (numpy,pandas)
            시각화 (matplotlib,seaborn)
            = 데이터베이스 , 공공 데이터 => CSV
            = 장고 = 스프링 ( 웹 )
        집합자료형
         = list : [1,2,3,4,..]
            배열형 ( 1차원)
            중복 허용이 가능 , 값을 변경해서 사용

        = tuple(1,2,3,4,..)
          데이터베이스에서 값을 읽기
          중복 데이터 허용 , 한번 전하면 변경이 불가능
        = 셀형 : 중복을 허용하지 않는다.
                {,1,2,3,4..}
        = 딕트형 : 키와 값 => JSON
            {"키",값,"키",값...}
            => 키는 중복이 불가능

        조건문
        if 조건문:
            처리문장
        elif 조건문장:
            처리문장
        else:
            처리문장
    2. 반복문
        while : 반복횟수가 없는 경우
        for : 반복횟수가 있는 경우

    3. 반복제어문

'''